# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Brew CLI apps
brew "ffmpeg"
brew "fish"
brew "git"
brew "git-extras"
brew "mas"
brew "maven"
brew "openjdk@17"
brew "tree"
brew "yt-dlp"

# App casks
cask "1password"
cask "cron"
cask "datagrip"
cask "discord"
cask "docker"
cask "eul"
cask "figma"
cask "firefox"
cask "gimp"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "keka"
cask "logi-options-plus"
cask "netnewswire"
cask "notion"
cask "obs"
cask "openvpn-connect"
cask "postman"
cask "protonvpn"
cask "raycast"
cask "shottr"
cask "sublime-text"
cask "tiles"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

# Mac App Store apps
mas "Amphetamine", id: 937984704
mas "Money", id: 1185488696
mas "Shazam", id: 897118787
mas "Shapr3D", id: 1091675654
mas "The Unarchiver", id: 425424353